var stage4_info = {
  width: 10, 
  height: 10, 
  cell_size: 64,
  px: 1,
  py: 1,
  gx: 6,
  gy: 5,
  keyx: -1,
  keyy: -1,
  map_info: [
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    [1, 0, 0, 5, 9, 3, 0, 0, 1, 1],
    [1, 3, 5, 0, 10, 1, 1, 3, 1, 1],
    [1, 1, 0, 5, 0, 1, 1, 0, 1, 1],
    [1, 1, 5, 0, 5, 0, 1, 0, 1, 1],
    [1, 0, 10, 0, 5, 0, 0, 0, 1, 1],
    [1, 10, 5, 5, 5, 5, 1, 1, 1, 1],
    [1, 0, 10, 0, 10, 0, 0, 1, 1, 1],
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
  ],
  heroine_sheet: "chiko_sheet",
  heroine_ss: "heroine_ss",
  max_count: 21,
};

var chiko_talk_info = {
  chara_image1: "chiko_A",
  chara_image2: "chiko_B",
  chara_name: "スーパーウルトラグレートハイパーワンダフルアルティメットタイガー『小日向千虎』",
  talkA: "ここを通りたければボクを倒してみせろー！",
  choice1: "ｳｵｵｵ！俺の本気の力を見せてやる！",
  choice2: "ｳｵｵｵ！こひなた最強！こひなた最強！",
  answer: 1,
  talkOK: "えへへ…最強だからなー。ボクがついてってあげるよ",
  talkNG: "ボッコボコにしてやらぁ！！！",
  badendtext: "勝負は一瞬だった。ねりなーの雑草のようなボディでは\n相手になるはずもなかったのだ…",
};
